backend/controllers/ColumnController.php

    public function actionView($id)
    {

        $getArticles = Column::findOne(Yii::$app->request->get('id'));
        return $this->render('view', [
            'model' => $this->findModel($id),
            'article' =>$getArticles->articles,

        ]);
---
SELECT * FROM `columns` WHERE `id`='3'
SELECT * FROM `article` WHERE `column_id`=3

    public function actionCreate()
    {
        $request = Yii::$app->request;
        $model = new Column();
        $model->created_at = time();
        $model->updated_at = time();
        $model->parentid = $request->get('id')?$request->get('id'):0;

        if ($model->load($request->post()) && $model->save()) {
---
INSERT INTO `columns` (`created_at`, `updated_at`, `parentid`, `cname`, `model_id`, `template_id`, `isArticle`, `isShow`, `sort`) VALUES (1427103317, 1427103317, 21, '合作客户', 1, 1, 1, 1, NULL)

    protected function findModel($id)
    {
        if (($model = Column::findOne($id)) !== null) {
---
SELECT * FROM `columns` WHERE `id`='3'