backend/models/ColumnSearch.php

    public function columnList()
    {
        $data = Column::find()->orderBy('sort')->asArray()->all();
---
SELECT * FROM `columns` ORDER BY `sort`